In [965]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import warnings

%matplotlib inline
warnings.filterwarnings("ignore")

In [966]:
PATH = "datasets/bank_churn_combined.csv"

In [967]:
dataset = pd.read_csv(PATH)

In [968]:
df = dataset.copy()

In [969]:
df.head()

,Customer_ID,Customer_Surname,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,15634602,Hargrave,23-03-2016,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit
1,15647311,Hill,09-10-2018,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain
2,15619304,Onio,25-03-2019,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit
3,15701354,Boni,24-10-2019,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain
4,15737888,Mitchell,22-11-2019,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain

In [970]:
df["Bank_Join_Date"] = pd.to_datetime(df["Bank_Join_Date"])

In [971]:
df.head()

,Customer_ID,Customer_Surname,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,15634602,Hargrave,2016-03-23,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit
1,15647311,Hill,2018-10-09,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain
2,15619304,Onio,2019-03-25,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit
3,15701354,Boni,2019-10-24,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain
4,15737888,Mitchell,2019-11-22,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain

In [972]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Customer_ID           10000 non-null  int64
 1   Customer_Surname      10000 non-null  object
 2   Bank_Join_Date        10000 non-null  datetime64[ns]
 3   Credit_Score          10000 non-null  int64
 4   Country               10000 non-null  object
 5   Gender                10000 non-null  object
 6   Age                   10000 non-null  int64
 7   Tenure_Years          10000 non-null  int64
 8   Account_Balance       10000 non-null  float64
 9   Number_Of_Products    10000 non-null  int64
 10  Has_Credit_Card       10000 non-null  object
 11  Active_Status         10000 non-null  object
 12  Estimated_Salary_EUR  10000 non-null  float64
 13  Churn_Status          10000 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(5), object(6)
memory usage: 1.1+ MB

In [973]:
df = df[~df.duplicated(subset="Customer_ID")]

In [974]:
df.head()

,Customer_ID,Customer_Surname,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,15634602,Hargrave,2016-03-23,619,France,Female,42,7,0.00,1,credit card holder,Active Member,101348.88,Exit
1,15647311,Hill,2018-10-09,608,Spain,Female,41,4,83807.86,1,non credit card holder,Active Member,112542.58,Retain
2,15619304,Onio,2019-03-25,502,France,Female,42,4,159660.80,3,credit card holder,Inactive Member,113931.57,Exit
3,15701354,Boni,2019-10-24,699,France,Female,39,3,0.00,2,non credit card holder,Inactive Member,93826.63,Retain
4,15737888,Mitchell,2019-11-22,850,Spain,Female,43,3,125510.82,1,credit card holder,Active Member,79084.10,Retain

In [975]:
df["Customer_Surname"].nunique()

2932

In [976]:
df = df.drop(columns=["Customer_ID", "Customer_Surname"])

In [977]:
df.isna().sum()

Bank_Join_Date          0
Credit_Score            0
Country                 0
Gender                  0
Age                     0
Tenure_Years            0
Account_Balance         0
Number_Of_Products      0
Has_Credit_Card         0
Active_Status           0
Estimated_Salary_EUR    0
Churn_Status            0
dtype: int64

In [978]:
from sklearn.model_selection import train_test_split

In [979]:
train_df, test_df = train_test_split(
    df,
    test_size=0.2,
    random_state=42,
    shuffle=True
)

In [980]:
train_df = train_df.reset_index(drop=True)
test_df  = test_df.reset_index(drop=True)

In [981]:
train_df.head()

,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,2016-08-29,686,France,Male,32,7,0.00,2,credit card holder,Active Member,179093.26,Retain
1,2017-11-10,632,Germany,Male,42,5,119624.60,2,credit card holder,Active Member,195978.86,Retain
2,2016-10-16,559,Spain,Male,24,6,114739.92,1,credit card holder,Inactive Member,85891.02,Exit
3,2019-12-08,561,France,Female,27,3,135637.00,1,credit card holder,Inactive Member,153080.40,Exit
4,2019-09-08,517,France,Male,56,4,142147.32,1,non credit card holder,Inactive Member,39488.04,Exit

In [982]:
test_df.head()

,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,2018-07-01,596,Germany,Male,32,5,96709.07,2,non credit card holder,Inactive Member,41788.37,Retain
1,2018-01-13,623,France,Male,43,5,0.00,2,credit card holder,Active Member,146379.30,Retain
2,2018-09-17,601,Spain,Female,44,5,0.00,2,credit card holder,Inactive Member,58561.31,Retain
3,2019-11-19,506,Germany,Male,59,3,119152.10,2,credit card holder,Active Member,170679.74,Retain
4,2016-09-14,560,Spain,Female,27,7,124995.98,1,credit card holder,Active Member,114669.79,Retain

In [983]:
train_df.shape

(8000, 12)

In [984]:
test_df.shape

(2000, 12)

In [985]:
train_df.head()

,Bank_Join_Date,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status
0,2016-08-29,686,France,Male,32,7,0.00,2,credit card holder,Active Member,179093.26,Retain
1,2017-11-10,632,Germany,Male,42,5,119624.60,2,credit card holder,Active Member,195978.86,Retain
2,2016-10-16,559,Spain,Male,24,6,114739.92,1,credit card holder,Inactive Member,85891.02,Exit
3,2019-12-08,561,France,Female,27,3,135637.00,1,credit card holder,Inactive Member,153080.40,Exit
4,2019-09-08,517,France,Male,56,4,142147.32,1,non credit card holder,Inactive Member,39488.04,Exit

In [986]:
train_df["Bank_Join_Date"] = pd.to_datetime(train_df["Bank_Join_Date"])
test_df["Bank_Join_Date"] = pd.to_datetime(test_df["Bank_Join_Date"])

In [987]:
train_df["Bank_Quarter"] = train_df["Bank_Join_Date"].dt.quarter
test_df["Bank_Quarter"] = test_df["Bank_Join_Date"].dt.quarter

In [988]:
train_df.columns

Index(['Bank_Join_Date', 'Credit_Score', 'Country', 'Gender', 'Age',
       'Tenure_Years', 'Account_Balance', 'Number_Of_Products',
       'Has_Credit_Card', 'Active_Status', 'Estimated_Salary_EUR',
       'Churn_Status', 'Bank_Quarter'],
      dtype='object')

In [989]:
train_df = train_df.drop(columns=["Bank_Join_Date"])
test_df = test_df.drop(columns=["Bank_Join_Date"])

In [990]:
train_df.columns

Index(['Credit_Score', 'Country', 'Gender', 'Age', 'Tenure_Years',
       'Account_Balance', 'Number_Of_Products', 'Has_Credit_Card',
       'Active_Status', 'Estimated_Salary_EUR', 'Churn_Status',
       'Bank_Quarter'],
      dtype='object')

In [991]:
train_df["Churn_Status"].value_counts() / train_df["Churn_Status"].shape[0]

Churn_Status
Retain    0.7945
Exit      0.2055
Name: count, dtype: float64

In [992]:
test_df["Churn_Status"].value_counts() / test_df["Churn_Status"].shape[0]

Churn_Status
Retain    0.8035
Exit      0.1965
Name: count, dtype: float64

In [993]:
train_df["Churn_Status"] = train_df["Churn_Status"].replace({
    "Retain": 0,
    "Exit": 1
})
test_df["Churn_Status"] = test_df["Churn_Status"].replace({
    "Retain": 0,
    "Exit": 1
})

In [994]:
train_df.head()

,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status,Bank_Quarter
0,686,France,Male,32,7,0.00,2,credit card holder,Active Member,179093.26,0,3
1,632,Germany,Male,42,5,119624.60,2,credit card holder,Active Member,195978.86,0,4
2,559,Spain,Male,24,6,114739.92,1,credit card holder,Inactive Member,85891.02,1,4
3,561,France,Female,27,3,135637.00,1,credit card holder,Inactive Member,153080.40,1,4
4,517,France,Male,56,4,142147.32,1,non credit card holder,Inactive Member,39488.04,1,3

In [995]:
test_df.head()

,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status,Bank_Quarter
0,596,Germany,Male,32,5,96709.07,2,non credit card holder,Inactive Member,41788.37,0,3
1,623,France,Male,43,5,0.00,2,credit card holder,Active Member,146379.30,0,1
2,601,Spain,Female,44,5,0.00,2,credit card holder,Inactive Member,58561.31,0,3
3,506,Germany,Male,59,3,119152.10,2,credit card holder,Active Member,170679.74,0,4
4,560,Spain,Female,27,7,124995.98,1,credit card holder,Active Member,114669.79,0,3

In [996]:
train_df.select_dtypes(exclude="number").columns

Index(['Country', 'Gender', 'Has_Credit_Card', 'Active_Status'], dtype='object')

In [997]:
test_df.select_dtypes(exclude="number").columns

Index(['Country', 'Gender', 'Has_Credit_Card', 'Active_Status'], dtype='object')

In [998]:
train_df["Gender"].unique()

array(['Male', 'Female'], dtype=object)

In [999]:
train_df["Has_Credit_Card"].unique()

array(['credit card holder', 'non credit card holder'], dtype=object)

In [1000]:
train_df["Active_Status"].unique()

array(['Active Member', 'Inactive Member'], dtype=object)

In [1001]:
train_df["Gender"] = train_df["Gender"].replace(
    {"Male": 1, "Female": 0}
)

test_df["Gender"] = test_df["Gender"].replace(
    {"Male": 1, "Female": 0}
)

train_df["Has_Credit_Card"] = train_df["Has_Credit_Card"].replace(
    {"credit card holder": 1, "non credit card holder": 0}
)

test_df["Has_Credit_Card"] = test_df["Has_Credit_Card"].replace(
    {"credit card holder": 1, "non credit card holder": 0}
)

train_df["Active_Status"] = train_df["Active_Status"].replace(
    {"Active Member": 1, "Inactive Member": 0}
)

test_df["Active_Status"] = test_df["Active_Status"].replace(
    {"Active Member": 1, "Inactive Member": 0}
)

In [1002]:
train_df.head()

,Credit_Score,Country,Gender,Age,Tenure_Years,Account_Balance,Number_Of_Products,Has_Credit_Card,Active_Status,Estimated_Salary_EUR,Churn_Status,Bank_Quarter
0,686,France,1,32,7,0.00,2,1,1,179093.26,0,3
1,632,Germany,1,42,5,119624.60,2,1,1,195978.86,0,4
2,559,Spain,1,24,6,114739.92,1,1,0,85891.02,1,4
3,561,France,0,27,3,135637.00,1,1,0,153080.40,1,4
4,517,France,1,56,4,142147.32,1,0,0,39488.04,1,3

In [1003]:
X_train = train_df.drop(columns=["Churn_Status"])
y_train = train_df["Churn_Status"]
X_test = test_df.drop(columns=["Churn_Status"])
y_test = test_df["Churn_Status"]

In [1004]:
X_train.shape, X_test.shape

((8000, 11), (2000, 11))

In [1005]:
from sklearn.preprocessing import StandardScaler, OneHotEncoder

In [1006]:
num_features = list(X_train.select_dtypes(include="number").columns)
cat_features = list(X_train.select_dtypes(exclude="number").columns)

In [1007]:
num_features

['Credit_Score',
 'Gender',
 'Age',
 'Tenure_Years',
 'Account_Balance',
 'Number_Of_Products',
 'Has_Credit_Card',
 'Active_Status',
 'Estimated_Salary_EUR',
 'Bank_Quarter']

In [1008]:
cat_features

['Country']

In [1009]:
from sklearn.compose import ColumnTransformer
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier, AdaBoostClassifier
from imblearn.pipeline import Pipeline
from imblearn.over_sampling import SMOTE
from sklearn.impute import SimpleImputer
from xgboost import XGBClassifier
from catboost import CatBoostClassifier
from sklearn.metrics import (
    accuracy_score,
    precision_score,
    recall_score,
    f1_score,
    roc_auc_score
)

In [1010]:
def make_preprocessor(model_type: str, non_skewed_features: list, skewed_features: list,
    cat_features: list):
    # noop -> no operation
    non_skewed_transformer = Pipeline(steps=[
        ("imputer", SimpleImputer(strategy="mean")),
        ("scaler", StandardScaler()) if model_type in ["linear", "knn"] 
                                    else ("noop", "passthrough")
    ])

    skewed_transformer = Pipeline(steps=[
        ("imputer", SimpleImputer(strategy="median")),
        ("scaler", StandardScaler()) if model_type in ["linear", "knn"] 
                                    else ("noop", "passthrough")
    ])

    if model_type == "linear":
        cat_transformer = Pipeline(steps=[
            ("imputer", SimpleImputer(strategy="most_frequent")),
            ("onehot", OneHotEncoder(drop="first", handle_unknown="ignore"))
        ])
    else:
        cat_transformer = Pipeline(steps=[
            ("imputer", SimpleImputer(strategy="most_frequent")),
            ("onehot", OneHotEncoder(handle_unknown="ignore"))
        ])

    preprocessor = ColumnTransformer(
        transformers=[
            ("non_skewed", non_skewed_transformer, non_skewed_features),
            ("skewed", skewed_transformer, skewed_features),
            ("cat", cat_transformer, cat_features)
        ]
    )

    return preprocessor

In [1011]:
def train_and_evaluate_classifiers(
    model_registry,
    X_train, y_train,
    X_test, y_test,
    numeric_features,
    categorical_features,
    use_smote=True
):
    results = []
    trained_models = {}

    for name, entry in model_registry.items():
        model = entry["model"]
        model_type = entry["type"]
        if model_type == "boosting_native":
            # X_train[categorical_features] = X_train[categorical_features].astype("category")
            # X_test[categorical_features] = X_test[categorical_features].astype("category")
            preprocessor = "passthrough"
            steps = [("model", model)]
            pipeline = Pipeline(steps)
        else:
            skewed_features = [feature for feature in numeric_features 
                                    if abs(X_train[feature].skew()) > 0.5]
            non_skewed_features = list(set(numeric_features) - set(skewed_features))
            preprocessor = make_preprocessor(
                model_type=model_type,
                non_skewed_features=non_skewed_features,
                skewed_features=skewed_features,
                cat_features=categorical_features
            )

            steps = [("preprocessor", preprocessor)]

            if use_smote:
                steps.append(("smote", SMOTE(random_state=42)))

            steps.append(("model", model))
            pipeline = Pipeline(steps)

        pipeline.fit(X_train, y_train)
        y_pred = pipeline.predict(X_test)
        if hasattr(model, "predict_proba"):
            y_proba = pipeline.predict_proba(X_test)[:, 1]
            roc_auc = roc_auc_score(y_test, y_proba)
        else:
            roc_auc = None

        results.append({
            "model": name,
            "accuracy": accuracy_score(y_test, y_pred),
            "precision": precision_score(y_test, y_pred, zero_division=0),
            "recall": recall_score(y_test, y_pred, zero_division=0),
            "f1": f1_score(y_test, y_pred, zero_division=0),
            "roc_auc": roc_auc
        })

        trained_models[name] = pipeline
    
    return (
        pd.DataFrame(results).sort_values("recall", ascending=False),
        trained_models
    )

- `Precision` -> FP focused
- `Recall` -> FN focused

In this case, it's better to focus more on `Recall`. 

Because missing a customer who is about to churn is more costly than contacting a customer who wouldnt churn.

In [1012]:
model_registry = {
    "Logistic Regression": {
        "model": LogisticRegression(n_jobs=-1, max_iter=2000),
        "type": "linear"
    },
    "KNN": {
        "model": KNeighborsClassifier(n_jobs=-1, n_neighbors=5),
        "type": "knn"
    },
    "Decision Tree": {
        "model": DecisionTreeClassifier(random_state=42),
        "type": "bagging"
    },
    "Random Forest": {
        "model": RandomForestClassifier(random_state=42, n_jobs=-1),
        "type": "bagging"
    },
    "AdaBoost": {
        "model": AdaBoostClassifier(random_state=42),
        "type": "boosting"
    },
    "XGBoost": {
        "model": XGBClassifier(
            eval_metric="logloss",
            use_label_encoder=False,
            random_state=42
        ),
        "type": "boosting"
    },
    "CatBoost": {
        "model": CatBoostClassifier(verbose=False, random_state=42,
                                    cat_features=cat_features),
        "type": "boosting_native"
    }
}

In [1014]:
X_train.shape, X_test.shape

((8000, 11), (2000, 11))

In [1015]:
num_features

['Credit_Score',
 'Gender',
 'Age',
 'Tenure_Years',
 'Account_Balance',
 'Number_Of_Products',
 'Has_Credit_Card',
 'Active_Status',
 'Estimated_Salary_EUR',
 'Bank_Quarter']

In [1016]:
cat_features

['Country']

In [1017]:
results_df, trained_pipelines = train_and_evaluate_classifiers(
    model_registry=model_registry,
    X_train=X_train,
    y_train=y_train,
    X_test=X_test,
    y_test=y_test,
    numeric_features=num_features,
    categorical_features=cat_features,
    use_smote=True
)

In [1022]:
results_df
# sorted based on recall

                 model  accuracy  precision    recall        f1   roc_auc
0  Logistic Regression    0.7250   0.391724  0.722646  0.508050  0.782645
1                  KNN    0.7330   0.392037  0.651399  0.489484  0.762946
4             AdaBoost    0.8355   0.577295  0.608142  0.592317  0.840812
2        Decision Tree    0.7835   0.455752  0.524173  0.487574  0.685546
5              XGBoost    0.8580   0.686007  0.511450  0.586006  0.854267
6             CatBoost    0.8665   0.728261  0.511450  0.600897  0.872576
3        Random Forest    0.8605   0.708029  0.493639  0.581709  0.848573

In [1019]:
SAVED_MODELS_PATH = "saved_models/"

In [1021]:
import joblib

In [1020]:
best_model_name = results_df.iloc[0]["model"]
best_pipeline = trained_pipelines[best_model_name]
joblib.dump(best_pipeline, f"{SAVED_MODELS_PATH}/best_model.pkl")

['saved_models//best_model.pkl']